; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-4-3-11)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p0-2 - location
	p0-5 - location
	p1-4 - location
	p1-5 - location
	p2-1 - location
	p2-3 - location
	p3-0 - location
	p5-2 - location
	)
	(:init
	(at driver1 s5)
	(at driver2 s4)
	(at driver3 s4)
	(at driver4 s5)
	(at truck1 s1)
	(empty truck1)
	(at truck2 s4)
	(empty truck2)
	(at truck3 s3)
	(empty truck3)
	(at package1 s5)
	(at package2 s4)
	(at package3 s1)
	(at package4 s0)
	(at package5 s2)
	(at package6 s4)
	(at package7 s1)
	(at package8 s3)
	(at package9 s5)
	(at package10 s2)
	(at package11 s5)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 75)
	(= (time-to-walk p0-2 s0) 75)
	(= (time-to-walk s2 p0-2) 37)
	(= (time-to-walk p0-2 s2) 37)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(= (time-to-walk s0 p0-5) 30)
	(= (time-to-walk p0-5 s0) 30)
	(= (time-to-walk s5 p0-5) 24)
	(= (time-to-walk p0-5 s5) 24)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(= (time-to-walk s1 p1-4) 59)
	(= (time-to-walk p1-4 s1) 59)
	(= (time-to-walk s4 p1-4) 25)
	(= (time-to-walk p1-4 s4) 25)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(= (time-to-walk s1 p1-5) 16)
	(= (time-to-walk p1-5 s1) 16)
	(= (time-to-walk s5 p1-5) 74)
	(= (time-to-walk p1-5 s5) 74)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(= (time-to-walk s2 p2-1) 13)
	(= (time-to-walk p2-1 s2) 13)
	(= (time-to-walk s1 p2-1) 80)
	(= (time-to-walk p2-1 s1) 80)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(= (time-to-walk s2 p2-3) 17)
	(= (time-to-walk p2-3 s2) 17)
	(= (time-to-walk s3 p2-3) 75)
	(= (time-to-walk p2-3 s3) 75)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(= (time-to-walk s3 p3-0) 8)
	(= (time-to-walk p3-0 s3) 8)
	(= (time-to-walk s0 p3-0) 96)
	(= (time-to-walk p3-0 s0) 96)
	(path s5 p5-2)
	(path p5-2 s5)
	(path s2 p5-2)
	(path p5-2 s2)
	(= (time-to-walk s5 p5-2) 6)
	(= (time-to-walk p5-2 s5) 6)
	(= (time-to-walk s2 p5-2) 53)
	(= (time-to-walk p5-2 s2) 53)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 18)
	(= (time-to-drive s1 s0) 18)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 25)
	(= (time-to-drive s3 s0) 25)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 80)
	(= (time-to-drive s4 s0) 80)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 74)
	(= (time-to-drive s2 s1) 74)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 66)
	(= (time-to-drive s3 s1) 66)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 97)
	(= (time-to-drive s0 s2) 97)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 64)
	(= (time-to-drive s3 s2) 64)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 76)
	(= (time-to-drive s4 s2) 76)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 10)
	(= (time-to-drive s5 s2) 10)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 14)
	(= (time-to-drive s4 s3) 14)
	(link s3 s5)
	(link s5 s3)
	(= (time-to-drive s3 s5) 53)
	(= (time-to-drive s5 s3) 53)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 8)
	(= (time-to-drive s5 s4) 8)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 7)
	(= (time-to-drive s1 s5) 7)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver2 s3)
	(at driver3 s0)
	(at driver4 s4)
	(at truck1 s5)
	(at truck2 s5)
	(at truck3 s5)
	(at package1 s2)
	(at package2 s5)
	(at package3 s5)
	(at package4 s5)
	(at package5 s3)
	(at package6 s1)
	(at package7 s1)
	(at package8 s2)
	(at package9 s0)
	(at package10 s4)
	(at package11 s4)
	))

(:metric minimize (+ (+ (* 1  (total-time)) (* 2  (driven))) (* 4  (walked))))

)

; plan
1. (board-truck driver2 truck2 s4)
   deleted: (at driver2 s4) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 1 of 17
2. (drive-truck truck2 s4 s3 driver2)
   deleted: (at truck2 s4)
   added: (at truck2 s3)
   changed: (driven) from 0 to 14
   goals met: 1 of 17
3. (load-truck package8 truck2 s3)
   deleted: (at package8 s3)
   added: (in package8 truck2)
   goals met: 1 of 17
4. (drive-truck truck2 s3 s2 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   changed: (driven) from 14 to 78
   goals met: 1 of 17
5. (unload-truck package8 truck2 s2)
   deleted: (in package8 truck2)
   added: (at package8 s2)
   goals met: 2 of 17
6. (load-truck package10 truck2 s2)
   deleted: (at package10 s2)
   added: (in package10 truck2)
   goals met: 2 of 17
7. (load-truck package5 truck2 s2)
   deleted: (at package5 s2)
   added: (in package5 truck2)
   goals met: 2 of 17
8. (drive-truck truck2 s2 s3 driver2)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   changed: (driven) from 78 to 142
   goals met: 2 of 17
9. (walk driver4 s5 p1-5)
   deleted: (at driver4 s5)
   added: (at driver4 p1-5)
   changed: (walked) from 0 to 74
   goals met: 2 of 17
10. (walk driver4 p1-5 s1)
   deleted: (at driver4 p1-5)
   added: (at driver4 s1)
   changed: (walked) from 74 to 90
   goals met: 2 of 17
11. (unload-truck package5 truck2 s3)
   deleted: (in package5 truck2)
   added: (at package5 s3)
   goals met: 3 of 17
12. (load-truck package3 truck1 s1)
   deleted: (at package3 s1)
   added: (in package3 truck1)
   goals met: 3 of 17
13. (board-truck driver4 truck1 s1)
   deleted: (at driver4 s1) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 3 of 17
14. (drive-truck truck1 s1 s5 driver4)
   deleted: (at truck1 s1)
   added: (at truck1 s5)
   changed: (driven) from 142 to 149
   goals met: 4 of 17
15. (unload-truck package3 truck1 s5)
   deleted: (in package3 truck1)
   added: (at package3 s5)
   goals met: 5 of 17
16. (load-truck package1 truck1 s5)
   deleted: (at package1 s5)
   added: (in package1 truck1)
   goals met: 5 of 17
17. (load-truck package11 truck1 s5)
   deleted: (at package11 s5)
   added: (in package11 truck1)
   goals met: 5 of 17
18. (drive-truck truck1 s5 s2 driver4)
   deleted: (at truck1 s5)
   added: (at truck1 s2)
   changed: (driven) from 149 to 159
   goals met: 4 of 17
19. (unload-truck package1 truck1 s2)
   deleted: (in package1 truck1)
   added: (at package1 s2)
   goals met: 5 of 17
20. (drive-truck truck1 s2 s4 driver4)
   deleted: (at truck1 s2)
   added: (at truck1 s4)
   changed: (driven) from 159 to 235
   goals met: 5 of 17
21. (unload-truck package11 truck1 s4)
   deleted: (in package11 truck1)
   added: (at package11 s4)
   goals met: 6 of 17
22. (load-truck package2 truck1 s4)
   deleted: (at package2 s4)
   added: (in package2 truck1)
   goals met: 6 of 17
23. (disembark-truck driver4 truck1 s4)
   deleted: (driving driver4 truck1)
   added: (at driver4 s4) (empty truck1)
   goals met: 7 of 17
24. (board-truck driver3 truck1 s4)
   deleted: (at driver3 s4) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 7 of 17
25. (drive-truck truck1 s4 s5 driver3)
   deleted: (at truck1 s4)
   added: (at truck1 s5)
   changed: (driven) from 235 to 243
   goals met: 8 of 17
26. (disembark-truck driver3 truck1 s5)
   deleted: (driving driver3 truck1)
   added: (at driver3 s5) (empty truck1)
   goals met: 8 of 17
27. (unload-truck package2 truck1 s5)
   deleted: (in package2 truck1)
   added: (at package2 s5)
   goals met: 9 of 17
28. (walk driver3 s5 p0-5)
   deleted: (at driver3 s5)
   added: (at driver3 p0-5)
   changed: (walked) from 90 to 114
   goals met: 9 of 17
29. (drive-truck truck2 s3 s5 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s5)
   changed: (driven) from 243 to 296
   goals met: 10 of 17
30. (load-truck package9 truck2 s5)
   deleted: (at package9 s5)
   added: (in package9 truck2)
   goals met: 10 of 17
31. (drive-truck truck2 s5 s4 driver2)
   deleted: (at truck2 s5)
   added: (at truck2 s4)
   changed: (driven) from 296 to 304
   goals met: 9 of 17
32. (load-truck package6 truck2 s4)
   deleted: (at package6 s4)
   added: (in package6 truck2)
   goals met: 9 of 17
33. (unload-truck package10 truck2 s4)
   deleted: (in package10 truck2)
   added: (at package10 s4)
   goals met: 10 of 17
34. (drive-truck truck2 s4 s0 driver2)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   changed: (driven) from 304 to 384
   goals met: 10 of 17
35. (unload-truck package9 truck2 s0)
   deleted: (in package9 truck2)
   added: (at package9 s0)
   goals met: 11 of 17
36. (load-truck package4 truck2 s0)
   deleted: (at package4 s0)
   added: (in package4 truck2)
   goals met: 11 of 17
37. (drive-truck truck2 s0 s1 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (driven) from 384 to 402
   goals met: 11 of 17
38. (unload-truck package6 truck2 s1)
   deleted: (in package6 truck2)
   added: (at package6 s1)
   goals met: 12 of 17
39. (drive-truck truck2 s1 s5 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s5)
   changed: (driven) from 402 to 409
   goals met: 13 of 17
40. (walk driver3 p0-5 s0)
   deleted: (at driver3 p0-5)
   added: (at driver3 s0)
   changed: (walked) from 114 to 144
   goals met: 14 of 17
41. (walk driver3 s0 p3-0)
   deleted: (at driver3 s0)
   added: (at driver3 p3-0)
   changed: (walked) from 144 to 240
   goals met: 13 of 17
42. (walk driver3 p3-0 s3)
   deleted: (at driver3 p3-0)
   added: (at driver3 s3)
   changed: (walked) from 240 to 248
   goals met: 13 of 17
43. (board-truck driver3 truck3 s3)
   deleted: (at driver3 s3) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 13 of 17
44. (drive-truck truck3 s3 s5 driver3)
   deleted: (at truck3 s3)
   added: (at truck3 s5)
   changed: (driven) from 409 to 462
   goals met: 14 of 17
45. (disembark-truck driver2 truck2 s5)
   deleted: (driving driver2 truck2)
   added: (at driver2 s5) (empty truck2)
   goals met: 14 of 17
46. (disembark-truck driver3 truck3 s5)
   deleted: (driving driver3 truck3)
   added: (at driver3 s5) (empty truck3)
   goals met: 14 of 17
47. (board-truck driver1 truck1 s5)
   deleted: (at driver1 s5) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 14 of 17
48. (unload-truck package4 truck2 s5)
   deleted: (in package4 truck2)
   added: (at package4 s5)
   goals met: 15 of 17
49. (drive-truck truck1 s5 s3 driver1)
   deleted: (at truck1 s5)
   added: (at truck1 s3)
   changed: (driven) from 462 to 515
   goals met: 14 of 17
50. (board-truck driver3 truck2 s5)
   deleted: (at driver3 s5) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 14 of 17
51. (drive-truck truck2 s5 s3 driver3)
   deleted: (at truck2 s5)
   added: (at truck2 s3)
   changed: (driven) from 515 to 568
   goals met: 13 of 17
52. (drive-truck truck2 s3 s0 driver3)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   changed: (driven) from 568 to 593
   goals met: 13 of 17
53. (board-truck driver2 truck3 s5)
   deleted: (at driver2 s5) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 13 of 17
54. (drive-truck truck2 s0 s1 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (driven) from 593 to 611
   goals met: 13 of 17
55. (drive-truck truck3 s5 s3 driver2)
   deleted: (at truck3 s5)
   added: (at truck3 s3)
   changed: (driven) from 611 to 664
   goals met: 12 of 17
56. (drive-truck truck2 s1 s5 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s5)
   changed: (driven) from 664 to 671
   goals met: 13 of 17
57. (disembark-truck driver1 truck1 s3)
   deleted: (driving driver1 truck1)
   added: (at driver1 s3) (empty truck1)
   goals met: 13 of 17
58. (disembark-truck driver2 truck3 s3)
   deleted: (driving driver2 truck3)
   added: (at driver2 s3) (empty truck3)
   goals met: 14 of 17
59. (board-truck driver1 truck3 s3)
   deleted: (at driver1 s3) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 14 of 17
60. (drive-truck truck3 s3 s5 driver1)
   deleted: (at truck3 s3)
   added: (at truck3 s5)
   changed: (driven) from 671 to 724
   goals met: 15 of 17
61. (board-truck driver2 truck1 s3)
   deleted: (at driver2 s3) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 14 of 17
62. (drive-truck truck1 s3 s0 driver2)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   changed: (driven) from 724 to 749
   goals met: 14 of 17
63. (drive-truck truck1 s0 s2 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   changed: (driven) from 749 to 846
   goals met: 14 of 17
64. (disembark-truck driver2 truck1 s2)
   deleted: (driving driver2 truck1)
   added: (at driver2 s2) (empty truck1)
   goals met: 14 of 17
65. (disembark-truck driver3 truck2 s5)
   deleted: (driving driver3 truck2)
   added: (at driver3 s5) (empty truck2)
   goals met: 14 of 17
66. (walk driver2 s2 p2-3)
   deleted: (at driver2 s2)
   added: (at driver2 p2-3)
   changed: (walked) from 248 to 265
   goals met: 14 of 17
67. (walk driver2 p2-3 s3)
   deleted: (at driver2 p2-3)
   added: (at driver2 s3)
   changed: (walked) from 265 to 340
   goals met: 15 of 17
68. (walk driver3 s5 p5-2)
   deleted: (at driver3 s5)
   added: (at driver3 p5-2)
   changed: (walked) from 340 to 346
   goals met: 15 of 17
69. (walk driver3 p5-2 s2)
   deleted: (at driver3 p5-2)
   added: (at driver3 s2)
   changed: (walked) from 346 to 399
   goals met: 15 of 17
70. (board-truck driver3 truck1 s2)
   deleted: (at driver3 s2) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 15 of 17
71. (drive-truck truck1 s2 s5 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s5)
   changed: (driven) from 846 to 856
   goals met: 16 of 17
72. (disembark-truck driver3 truck1 s5)
   deleted: (driving driver3 truck1)
   added: (at driver3 s5) (empty truck1)
   goals met: 16 of 17
73. (walk driver3 s5 p0-5)
   deleted: (at driver3 s5)
   added: (at driver3 p0-5)
   changed: (walked) from 399 to 423
   goals met: 16 of 17
74. (walk driver3 p0-5 s0)
   deleted: (at driver3 p0-5)
   added: (at driver3 s0)
   changed: (walked) from 423 to 453
   goals met: 17 of 17
